set_false_path -from [get_clocks clk_pl_0] -to [get_ports LED2_N_PWR_SYNC]

create_clock -period 8.000 -name SOM_CLK_1 -waveform {0.000 4.000} [get_ports {SOM_IN_CLK_P[1]}]
create_clock -period 8.000 -name SOM_CLK_0 -waveform {0.000 4.000} [get_ports {SOM_IN_CLK_P[0]}]
create_clock -period 4.000 -name TD_CLK -waveform {0.000 2.000} [get_ports FPGA_CLK250_TD_P]
create_clock -period 10.000 -name OSC_CLK -waveform {0.000 5.000} [get_ports CLNR_OSC_P]

# create_clock -period 8.000 -name {ADC_DCO[1]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[1]}]
# create_clock -period 8.000 -name {ADC_DCO[2]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[2]}]
# create_clock -period 8.000 -name {ADC_DCO[3]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[3]}]
# create_clock -period 8.000 -name {ADC_DCO[4]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[4]}]
# create_clock -period 8.000 -name {ADC_DCO[5]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[5]}]
# create_clock -period 8.000 -name {ADC_DCO[6]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[6]}]
# create_clock -period 8.000 -name {ADC_DCO[7]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[7]}]
# create_clock -period 8.000 -name {ADC_DCO[8]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[8]}]
# create_clock -period 8.000 -name {ADC_DCO[9]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[9]}]
# create_clock -period 8.000 -name {ADC_DCO[10]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[10]}]
# create_clock -period 8.000 -name {ADC_DCO[11]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[11]}]
# create_clock -period 8.000 -name {ADC_DCO[12]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[12]}]
# create_clock -period 8.000 -name {ADC_DCO[13]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[13]}]
# create_clock -period 8.000 -name {ADC_DCO[14]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[14]}]
# create_clock -period 8.000 -name {ADC_DCO[15]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[15]}]
# create_clock -period 8.000 -name {ADC_DCO[16]} -waveform {0.000 4.000} [get_ports {ADC_DCO_P[16]}]

# set_clock_groups -asynchronous -group clk_pl_0 -group SOM_CLK_0 -group SOM_CLK_1 -group TD_CLK -group OSC_CLK -group ADC_DCO[1] -group ADC_DCO[2] -group ADC_DCO[3] -group ADC_DCO[4] -group ADC_DCO[5] -group ADC_DCO[6] -group ADC_DCO[7] -group ADC_DCO[8] -group ADC_DCO[9] -group ADC_DCO[10] -group ADC_DCO[11] -group ADC_DCO[12] -group ADC_DCO[13] -group ADC_DCO[14] -group ADC_DCO[15] -group ADC_DCO[16]
set_clock_groups -asynchronous -group clk_pl_0 -group clk_pl_1 -group TD_CLK -group OSC_CLK


# set_false_path -from [get_ports LMK_STAT_HOLDOVER]
# set_false_path -from [get_ports LMK_STAT_LD]
# set_false_path -from [get_ports {SW1[*]}]
# set_false_path -to [get_ports {LED_DSP[*]}]
# set_false_path -to [get_ports LMK_UWIRE_CLK]
# set_false_path -to [get_ports LMK_UWIRE_DATA]
# set_false_path -to [get_ports LMK_UWIRE_LE]

set_false_path -from [get_ports {SW1[5]}] -to [get_ports LMK_STAT_CLKin1]
set_false_path -from [get_ports {SW1[6]}] -to [get_ports LMK_STAT_CLKin0]
set_false_path  -to [get_ports LMK_STAT_HOLDOVER]
set_false_path -to [get_ports {LED_DSP[*]}]

set_output_delay -clock [get_clocks OSC_CLK] -min -add_delay 0.000 [get_ports LMK_UWIRE_CLK]
set_output_delay -clock [get_clocks OSC_CLK] -max -add_delay 0.200 [get_ports LMK_UWIRE_CLK]
set_output_delay -clock [get_clocks OSC_CLK] -min -add_delay 0.000 [get_ports LMK_UWIRE_DATA]
set_output_delay -clock [get_clocks OSC_CLK] -max -add_delay 0.200 [get_ports LMK_UWIRE_DATA]
set_output_delay -clock [get_clocks OSC_CLK] -min -add_delay 0.000 [get_ports LMK_UWIRE_LE]
set_output_delay -clock [get_clocks OSC_CLK] -max -add_delay 0.200 [get_ports LMK_UWIRE_LE]

set_false_path -from [get_clocks OSC_CLK] -to [get_clocks clk_adc_mmcm_adc]
set_false_path -from [get_clocks -of_objects [get_pins clock_subsystem/adc_mmcm/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks OSC_CLK]
set_false_path -from [get_clocks -of_objects [get_pins clock_subsystem/adc_mmcm/inst/mmcme4_adv_inst/CLKOUT1]] -to [get_clocks TD_CLK]



set_property MARK_DEBUG true [get_nets {adc_subsystem/adc/genblk1[9].da_delay/delay_rdy}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc/genblk1[9].da_delay/en_vtc}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[0]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[1]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[2]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[3]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[4]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[5]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[6]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_ctrl_sample_rate[7]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[43]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[35]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[23]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[3]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[19]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[15]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[39]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[27]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[31]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[47]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[71]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[67]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[87]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[83]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[95]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[115]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[119]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[107]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[111]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[131]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[135]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[123]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[127]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[139]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[143]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[91]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[79]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[99]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[103]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[75]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[63]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[59]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[55]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[51]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[9]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[11]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[30]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[2]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[18]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[22]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[6]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[14]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[34]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[38]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[26]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[54]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[50]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[42]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[46]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[70]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[66]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[86]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[82]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[94]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[114]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[118]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[106]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[110]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[130]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[134]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[122]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[126]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[138]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[142]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[90]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[78]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[98]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[102]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[74]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[62]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[58]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[10]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[45]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[8]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[5]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[1]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[21]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[17]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[37]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[33]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[65]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[69]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[57]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[61]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[81]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[85]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[73]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[77]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[89]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[97]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[101]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[93]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[113]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[117]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[105]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[109]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[129]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[133]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[121]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[125]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[137]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[141]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[41]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[29]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[49]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[53]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[25]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[13]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[24]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[7]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[0]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[4]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[16]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[20]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[12]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[32]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[36]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[28]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[48]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[52]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[40]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[44]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[64]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[68]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[56]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[60]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[80]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[84]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[72]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[76]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[96]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[88]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[100]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[92]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[112]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[116]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[104]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[108]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[128]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[132]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[120]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[124]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[136]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_load_value[140]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[43]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[35]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[23]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[3]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[19]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[15]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[39]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[27]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[31]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[47]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[71]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[67]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[87]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[83]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[95]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[115]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[119]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[107]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[111]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[131]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[135]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[123]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[127]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[139]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[143]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[91]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[79]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[99]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[103]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[75]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[63]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[59]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[55]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[51]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[9]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[11]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[30]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[2]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[18]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[22]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[6]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[14]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[34]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[38]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[26]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[54]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[50]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[42]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[46]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[70]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[66]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[86]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[82]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[94]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[114]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[118]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[106]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[110]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[130]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[134]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[122]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[126]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[138]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[142]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[90]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[78]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[98]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[102]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[74]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[62]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[58]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[10]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[45]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[8]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[5]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[1]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[21]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[17]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[37]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[33]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[65]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[69]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[57]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[61]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[81]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[85]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[73]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[77]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[89]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[97]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[101]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[93]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[113]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[117]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[105]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[109]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[129]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[133]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[121]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[125]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[137]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[141]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[41]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[29]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[49]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[53]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[25]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[13]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[24]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[7]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[0]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[4]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[16]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[20]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[12]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[32]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[36]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[28]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[48]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[52]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[40]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[44]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[64]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[68]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[56]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[60]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[80]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[84]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[72]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[76]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[96]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[88]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[100]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[92]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[112]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[116]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[104]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[108]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[128]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[132]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[120]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[124]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[136]}]
set_property MARK_DEBUG true [get_nets {adc_subsystem/adc_delay_value[140]}]



